RhinoInside.Revit API Documentation
RectangleConverter.ToRectangle Method (Rectangle)
 Converts the specified Autodesk.Revit.DB.Rectangle to an equivalent Rectangle.
 Namespace: RhinoInside.Revit.Convert.System.Drawing
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Rectangle ToRectangle(
	this Autodesk.Revit.DB.Rectangle rectangle
)
@staticmethod
def ToRectangle(
	rectangle: Autodesk.Revit.DB.Rectangle
) -> Rectangle
Parameters
rectangle
Type: Autodesk.Revit.DB.Rectangle
System rectangle to convert.
Return Value
Type: Rectangle
Revit rectangle that is equivalent to the provided System rectangle.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Rectangle. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToRectangle(Rectangle) as extension method:
using System.Drawing;
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.System.Drawing;
Rectangle rectangle = revitRectangle.ToRectangle();
import clr
clr.AddReference("System.Drawing")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from System.Drawing import Rectangle
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.System.Drawing
clr.ImportExtensions(RhinoInside.Revit.Convert.System.Drawing)
rectangle = revit_rectangle.ToRectangle()    # type: Rectangle
 Using ToRectangle(Rectangle) as static method:
using System.Drawing;
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.System.Drawing;
Rectangle rectangle = RectangleConverter.ToRectangle(revitRectangle)
import clr
clr.AddReference("System.Drawing")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
clr.AddReference("Eto")
from System.Drawing import Rectangle
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.System.Drawing.RectangleConverter as RC
rectangle = RC.ToRectangle(revit_rectangle)    # type: Rectangle
See Also
Reference
RectangleConverter Class
ToRectangle Overload
RhinoInside.Revit.Convert.System.Drawing Namespace